app/Controllers/Autenticacao.php

    public function recuperarSenha()
    {
        if ($this->request->getMethod() === 'POST') {
            $cpf = preg_replace('/[^0-9]/', '', $this->request->getPost('cpf'));
            $senhaNova = $this->request->getPost('senha');

            $user = $this->usuarioModel->findByCpfNormalized($cpf);

            if ($user) {
                if ($user['ativo'] == 0) {
                    return view('autenticador/recuperar_senha', ['errors' => 'Usuário inativo. Recuperação de senha não permitida.']);
                }

                // Atualiza senha e define que não precisa mais alterar
                $this->usuarioModel->update($user['id'], [
                    'senha' => $senhaNova,
                    'precisa_alterar_senha' => 0
                ]);
---
UPDATE `users` SET `senha` = '123456', `precisa_alterar_senha` = 0, `updated_at` = '2025-08-20 13:53:58'
WHERE `users`.`id` IN ('1')