app/Controllers/Clientes.php

SELECT DISTINCT `empresa_concerto`.`unidade`
FROM `empresa_concerto`
WHERE `empresa_concerto`.`estado` = 'Parana'
---
    private function getUnidadesReaisPorEstado($estado)
    {
        $query = $this->empresaConcertoModel->builder()
            ->distinct()
            ->select('empresa_concerto.unidade') // <- Aqui está o ajuste
            ->where('empresa_concerto.estado', $estado)
            ->get()
            ->getResultArray();