app/Controllers/Compras.php

    private function getSugestoesDeCompra()
    {
        $equipamentosBanco = $this->equipamentoModel->findAll(); // equipamentos já cadastrados
---
SELECT *
FROM `equipamentos`