app/Controllers/Emprestimos.php

SELECT *
FROM `emprestimos`
ORDER BY `data_emprestimo` DESC
SELECT *
FROM `equipamentos`
---
                  ->groupEnd();
        }

        $emprestimos = $query->orderBy('data_emprestimo', 'DESC')->findAll();

        // --- Filtragem de equipamentos ---
        if ($tipo === 'admin') {
            $equipamentosPermitidos = $this->equipamentoModel->findAll();

SELECT *
FROM `equipamentos`
WHERE `unidade` = 'Betim '
---
                ->findAll();
        } else {
            // Técnico vê somente equipamentos da própria unidade
            $equipamentosPermitidos = $this->equipamentoModel
                ->where('unidade', $unidade)
                ->findAll();