app/Controllers/Equipamentos.php

SELECT *
FROM `equipamentos`
WHERE `nome` = 'Monitor '
AND `modelo` = 'Monitor Itaú Tec'
AND `unidade` = 'Praça Sete'
AND `estado` = 'Minas Gerais'
 LIMIT 1
---
    public function salvar()
    {
        if ($this->request->getMethod() !== 'POST') {
            return redirect()->to('/equipamentos')->with('erro', 'Método inválido.');
        }

        $nome = $this->request->getPost('nome');
        $modelo = $this->request->getPost('modelo');
        $quantidade = (int) $this->request->getPost('quantidade');
        $unidade = session('unidade');
        $estado = session('estado');

        if (empty($nome) || empty($modelo) || $quantidade < 1) {
            return redirect()->back()->withInput()->with('erro', 'Preencha todos os campos corretamente.');
        }

        // Verifica se já existe o mesmo equipamento/modelo/unidade/estado
        $equipamentoExistente = $this->equipamentoModel
            ->where('nome', $nome)
            ->where('modelo', $modelo)
            ->where('unidade', $unidade)
            ->where('estado', $estado)
            ->first();

INSERT INTO `equipamentos` (`nome`, `modelo`, `quantidade_backup`, `quantidade_uso`, `unidade`, `estado`, `created_at`, `updated_at`) VALUES ('Monitor ', 'Monitor Itaú Tec', 10, 0, 'Praça Sete', 'Minas Gerais', '2025-08-14 12:13:16', '2025-08-14 12:13:16')
---
            return redirect()->to('/equipamentos')->with('msg', 'Quantidade atualizada com sucesso.');
        } else {
            // Insere novo
            $this->equipamentoModel->insert([
                'nome' => $nome,
                'modelo' => $modelo,
                'quantidade_backup' => $quantidade,
                'quantidade_uso' => 0,
                'unidade' => $unidade,
                'estado' => $estado,
            ]);