app/Controllers/ProjetoController.php

INSERT INTO `projetos` (`nome`, `descricao`, `unidade`, `estado`, `progresso`, `status`, `acoes`, `data_conclusao`, `created_at`, `updated_at`) VALUES ('Teste de cadastro    ', 'teste', 'Poupa Tempo Bangu', 'Rio de Janeiro', '0', 'EM ANDAMENTO', '', '', '2025-08-13 13:16:32', '2025-08-13 13:16:32')
---
	    ];

	    // Salva no banco
	    $this->projetoModel->insert($data);