app/Models/AtendimentoModel.php

    public function getAtendimentosDoDia($usuarioId)
    {
        return $this->where('usuario_id', $usuarioId)
                    ->where('DATE(created_at)', date('Y-m-d'))
                    ->findAll();
---
SELECT *
FROM `atendimentos`
WHERE `usuario_id` = '9'
AND DATE(created_at) = '2025-08-13'

    public function getResumoOntem($usuarioId)
    {
        return $this->where('usuario_id', $usuarioId)
                    ->where('DATE(created_at)', date('Y-m-d', strtotime('-1 day')))
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `atendimentos`
WHERE `usuario_id` = '9'
AND DATE(created_at) = '2025-08-12'

    public function getResumoHoje($usuarioId)
    {
        return $this->where('usuario_id', $usuarioId)
                    ->where('DATE(created_at)', date('Y-m-d'))
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `atendimentos`
WHERE `usuario_id` = '9'
AND DATE(created_at) = '2025-08-13'