app/Models/EquipamentoModel.php

SELECT *
FROM `equipamentos`
WHERE `unidade` = 'Praça Sete'
---
    public function getEquipamentosPorUsuario($tipo, $unidade = null, $estado = null, $filtroUnidade = null)
    {
        $builder = $this->builder();

        if ($tipo === 'admin') {
            // Admin pode filtrar por estado/unidade, mas se não selecionar vê tudo
            if (!empty($estado) && $estado !== 'BRASIL') {
                $builder->where('estado', $estado);
            }
            if (!empty($filtroUnidade)) {
                $builder->where('unidade', $filtroUnidade);
            }
        } elseif ($tipo === 'supervisor') {
            // Supervisor vê todas as unidades do seu estado
            $builder->where('estado', $estado);
            if (!empty($filtroUnidade)) {
                $builder->where('unidade', $filtroUnidade);
            }
        } else {
            // Outros usuários só veem sua própria unidade
            $builder->where('unidade', $unidade);
        }

        return $builder->get()->getResultArray();

SELECT *
FROM `equipamentos`
WHERE `equipamentos`.`id` = '5'
UPDATE `equipamentos` SET `quantidade_backup` = 23, `quantidade_uso` = 0, `updated_at` = '2025-08-14 11:51:57'
WHERE `equipamentos`.`id` IN ('5')
---
    public function alterarStatusUsoBackup($id, $acao)
    {
        $equip = $this->find($id);
        if (!$equip) return false;

        if ($acao === 'usar' && $equip['quantidade_backup'] > 0) {
            return $this->update($id, [
                'quantidade_backup' => $equip['quantidade_backup'] - 1,
                'quantidade_uso'    => $equip['quantidade_uso'] + 1
            ]);
        }

        if ($acao === 'liberar' && $equip['quantidade_uso'] > 0) {
            return $this->update($id, [
                'quantidade_backup' => $equip['quantidade_backup'] + 1,
                'quantidade_uso'    => $equip['quantidade_uso'] - 1
            ]);