app/Models/JaChegouModel.php

SELECT `documentos_cidadao`.*, `users`.`nome` AS `nome_entregador`
FROM `documentos_cidadao`
LEFT JOIN `users` ON `users`.`id` = `documentos_cidadao`.`entregue_por`
WHERE `documentos_cidadao`.`unidade` = 'Juiz de Fora'
ORDER BY `documentos_cidadao`.`data_recebimento` DESC
---
    public function getDocumentosComNome()
    {
        return $this->select('documentos_cidadao.*, users.nome AS nome_entregador')
                    ->join('users', 'users.id = documentos_cidadao.entregue_por', 'left')
                    ->where('documentos_cidadao.unidade', session()->get('unidade'))
                    ->orderBy('documentos_cidadao.data_recebimento', 'DESC')
                    ->findAll();